test/request-response-samples/SessionCreateRQ__should_handle_multiple_parts/soap.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="https://webservices.sabre.com/websvc" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsd1="http://www.opentravel.org/OTA/2002/11" targetNamespace="https://webservices.sabre.com/websvc">
	<types>
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://www.opentravel.org/OTA/2002/11" schemaLocation="SessionCreateRQRS.xsd"/>
			<xsd:import namespace="http://www.ebxml.org/namespaces/messageHeader" schemaLocation="msg-header-2_0.xsd"/>
			<xsd:import namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" schemaLocation="wsse.xsd"/>
		</xsd:schema>
	</types>
	<message name="GetSessionCreateInput">
		<part element="eb:MessageHeader" name="header"/>
		<part element="wsse:Security" name="header2"/>
		<part element="xsd1:SessionCreateRQ" name="body"/>
	</message>
	<message name="GetSessionCreateOutput">
		<part element="eb:MessageHeader" name="header"/>
		<part element="wsse:Security" name="header2"/>
		<part element="xsd1:SessionCreateRS" name="body"/>
	</message>
	<portType name="SessionCreatePortType">
		<operation name="SessionCreateRQ">
			<input message="tns:GetSessionCreateInput"/>
			<output message="tns:GetSessionCreateOutput"/>
		</operation>
	</portType>
	<binding name="SessionCreateSoapBinding" type="tns:SessionCreatePortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="SessionCreateRQ">
			<soap:operation soapAction="OTA"/>
			<input>
				<soap:header message="tns:GetSessionCreateInput" part="header" use="literal"/>
				<soap:header message="tns:GetSessionCreateInput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</input>
			<output>
				<soap:header message="tns:GetSessionCreateOutput" part="header" use="literal"/>
				<soap:header message="tns:GetSessionCreateOutput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</output>
		</operation>
	</binding>
	<service name="SessionCreateRQService">
		<port binding="tns:SessionCreateSoapBinding" name="SessionCreatePortType">
			<soap:address location="https://sws-crt.cert.sabre.com/"/>
		</port>
	</service>
</definitions>
