test/request-response-samples/SessionCreateRQ__should_handle_multiple_parts/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:tns="https://webservices.sabre.com/websvc" xmlns:xsd1="http://www.opentravel.org/OTA/2002/11"><soap:Header><eb:MessageHeader xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns="http://www.ebxml.org/namespaces/messageHeader"><eb:ConversationId>elia@mytravelershaven.com</eb:ConversationId><eb:From><eb:PartyId type="urn:x12.org:IO5:01">hotelengine.com</eb:PartyId></eb:From><eb:To><eb:PartyId type="urn:x12.org:IO5:01">webservices.sabre.com</eb:PartyId></eb:To><eb:CPAId>P40G</eb:CPAId><eb:Service type="sabreXML">Session</eb:Service><eb:Action>SessionCreateRQ</eb:Action><eb:MessageData><eb:MessageId>mid:20150117-013924@hotelengine.com</eb:MessageId><eb:RefToMessageId></eb:RefToMessageId><eb:Timestamp>2015-01-17T01:39:24-08:00</eb:Timestamp></eb:MessageData></eb:MessageHeader></soap:Header><soap:Body><xsd1:SessionCreateRQ xmlns:xsd1="http://www.opentravel.org/OTA/2002/11" xmlns="http://www.opentravel.org/OTA/2002/11"><xsd1:POS><xsd1:Source PseudoCityCode="P40G"></xsd1:Source></xsd1:POS></xsd1:SessionCreateRQ></soap:Body></soap:Envelope>